//дододатковий метод для роботи з локальним сховком
// з використанням генериків
export const retriveLocalStorage = <T>(key: string) => {

    //отримуємо поточні дані з локального сховку
    //якщо таких немає встановлюємо значення як пусту стрінгу
    const object = localStorage.getItem(key) || '';
    if (!object) {

        //якщо значення в сховку пусте чи ми щойно створили його
        //як пусту стрінгу то повертаємо пустий об'єкт типізований відповідно до генеріка
        return {} as T;
    }

    //парсимо наш об'єкт
    const parse = JSON.parse(object);

    // повертаємо парснутий об'єкт з типізацією генеріку
    return parse as T;

}